
create table m_names ([name] nvarchar(64), id int unique identity(1,1) not null )

insert into m_names ([name]) values
('Авдей'),('Агафон'),('Александр'),('Алексей'),('Анатолий'),('Андрей'),('Антон'),('Аристарх'),('Аркадий'),('Арсений'),('Артём'),('Артур'),
('Афанасий'),('Богдан'),('Борис'),('Вадим'),('Валентин'),('Валерий'),('Валерьян'),('Василий'),('Викентий'),('Виктор'),('Виталий'),('Владимир'),
('Владислав'),('Всеволод'),('Вячеслав'),('Гавриил'),('Геннадий'),('Георгий'),('Герасим'),('Герман'),('Глеб'),('Григорий'),('Даниил'),('Демьян'),('Денис'),
('Дмитрий'),('Добрыня'),('Дорофей'),('Евгений'),('Евдоким'),('Егор'),('Емельян'),('Ефим'),('Зиновий'),('Иван'),('Игнатий'),('Игорь'),('Илья'),('Иннокентий'),
('Ираклий'),('Ким'),('Кирилл'),('Климент'),('Кондрат'),('Константин'),('Корнилий'),('Кузьма'),('Лев'),('Леонид'),('Леонтий'),('Лука'),('Макар'),('Максим'),
('Марк'),('Матвей'),('Мирон'),('Михаил'),('Мстислав'),('Назар'),('Нестор'),('Никита'),('Николай'),('Никон'),('Олег'),('Павел'),('Пётр'),('Платон'),('Прохор'),
('Родион'),('Роман'),('Ростислав'),('Руслан'),('Савва'),('Святослав'),('Севастьян'),('Семён'),('Сергей'),('Сильвестр'),('Станислав'),('Степан'),('Тарас'),('Тимофей'),
('Тимур'),('Тихон'),('Трифон'),('Трофим'),('Фёдор'),('Феликс'),('Филат'),('Филипп'),('Фома'),('Эдуард'),('Эраст'),('Юрий'),('Яков'),('Ярослав')

create table m_secnames ([name] nvarchar(64), id int unique identity(1,1) not null )

insert into m_secnames ([name]) values
('Авдеевич'),('Агафонович'),('Александрович'),('Алексеевич'),('Анатольевич'),('Андреевич'),('Антонович'),('Аристархович'),('Аркадиевич'),('Арсениевич'),('Артёмович'),
('Артурович'),('Афанасиевич'),('Богданович'),('Борисович'),('Вадимович'),('Валентинович'),('Валериевич'),('Валерьянович'),('Василиевич'),('Викентиевич'),('Викторович'),
('Виталиевич'),('Владимирович'),('Владиславович'),('Всеволодович'),('Вячеславович'),('Гавриилович'),('Геннадиевич'),('Георгиевич'),('Герасимович'),('Германович'),('Глебович'),('Григориевич'),
('Даниилович'),('Демьянович'),('Денисович'),('Дмитриевич'),('Добрынич'),('Дорофеевич'),('Евгениевич'),('Евдокимович'),('Егорович'),('Емельянович'),('Ефимович'),('Зиновьич'),('Иванович'),
('Игнатиевич'),('Игоревич'),('Ильич'),('Иннокентиевич'),('Ираклиевич'),('Кимович'),('Кириллович'),('Климентович'),('Кондратович'),('Константинович'),('Корнилиевич'),('Кузьмич'),('Львович'),
('Леонидович'),('Леонтиевич'),('Лукич'),('Макарович'),('Максимович'),('Маркович'),('Матвеевич'),('Миронович'),('Михайлович'),('Мстиславович'),('Назарович'),('Несторович'),('Никитич'),
('Николаевич'),('Никонович'),('Олегович'),('Павлович'),('Пётрович'),('Платонович'),('Прохорович'),('Родионович'),('Романович'),('Ростиславович'),('Русланович'),('Саввич'),
('Святославович'),('Севастьянович'),('Семёнович'),('Сергеевич'),('Сильвестрович'),('Станиславович'),('Степанович'),('Тарасович'),('Тимофеевич'),('Тимурович'),('Тихонович'),
('Трифонович'),('Трофимович'),('Фёдорович'),('Феликсович'),('Филатович'),('Филиппович'),('Фомич'),('Эдуардович'),('Эрастович'),('Юриевич'),('Якович'),('Ярославович')
