create table f_names  ([name] nvarchar(64), id int identity )

insert into f_names ([name] ) values
('Агафья'),('Агриппина'),('Александра'),('Алина'),('Алла'),('Анастасия'),('Ангелина'),('Анжела'),('Анна'),('Антонина'),('Анфиса'),('Валентина'),('Валерия'),('Варвара'),
('Василиса'),('Вера'),('Вероника'),('Виктория'),('Галина'),('Глафира'),('Дана'),('Дарья'),('Евгения'),('Евдокия'),('Евпраксия'),('Евфросиния'),('Екатерина'),('Елена'),
('Елизавета'),('Жанна'),('Зинаида'),('Злата'),('Зоя'),('Инга'),('Инесса'),('Инна'),('Ираида'),('Ирина'),('Карина'),('Каролина'),('Кира'),('Клавдия'),('Ксения'),('Лада'),
('Лариса'),('Лидия'),('Лилия'),('Любовь'),('Людмила'),('Маргарита'),('Марина'),('Мария'),('Марфа'),('Матрёна'),('Мирослава'),('Надежда'),('Наталья'),('Нина'),('Нонна'),
('Оксана'),('Октябрина'),('Ольга'),('Пелагея'),('Полина'),('Прасковья'),('Рада'),('Раиса'),('Римма'),('Светлана'),('Серафима'),('Снежана'),('Софья'),('Таисия'),('Тамара'),
('Татьяна'),('Ульяна'),('Фаина'),('Феврония'),('Фёкла'),('Федора'),('Юлия'),('Яна'),('Ярослава')

create table f_secnames  ([name] nvarchar(64), id int identity )

insert into f_secnames ([name] ) values
('Авдеевна'),('Агафоновна'),('Александровна'),('Алексеевна'),('Анатольевна'),('Андреевна'),('Антоновна'),('Аристарховна'),('Аркадиевна'),('Арсеньевна'),('Артёмовна'),
('Артуровна'),('Афанасиевна'),('Богдановна'),('Борисовна'),('Вадимовна'),('Валентиновна'),('Валериевна'),('Валерьяновна'),('Васильевна'),('Викентиевна'),
('Викторовна'),('Витальевна'),('Владимировна'),('Владиславовна'),('Всеволодовна'),('Вячеславовна'),('Гаврииловна'),('Геннадьевна'),('Георгиевна'),('Герасимовна'),
('Германовна'),('Глебовна'),('Григорьевна'),('Данииловна'),('Демьяновна'),('Денисовна'),('Дмитриевна'),('Добрынична'),('Дорофеевна'),('Евгеньевна'),
('Евдокимовна'),('Егоровна'),('Емельяновна'),('Ефимовна'),('Зиновьевна'),('Ивановна'),('Игнатьевна'),('Игорьевна'),('Ильинична'),('Иннокентий'),('Ираклиевна'),
('Кимовна'),('Кирилловна'),('Климентична'),('Кондратовна'),('Константиновна'),('Корнильична'),('Кузьминична'),('Львовна'),('Леонидовна'),('Леонтиевна'),
('Лукинична'),('Макаровна'),('Максимовна'),('Марковна'),('Матвеевна'),('Мироновна'),('Михайловна'),('Мстиславовна'),('Назаровна'),('Несторовна'),('Никитична'),
('Николаевна'),('Никоновна'),('Олеговна'),('Павловна'),('Петровна'),('Платоновна'),('Прохоровна'),('Родионовна'),('Романовна'),('Ростиславовна'),('Руслановна'),
('Саввична'),('Святославовна'),('Севастьяновна'),('Семёновна'),('Сергеевна'),('Сильвестровна'),('Станиславовна'),('Степановна'),('Тарасовна'),('Тимофеевна'),
('Тимуровна'),('Тихоновна'),('Трифоновна'),('Трофимовна'),('Фёдоровна'),('Феликсовна'),('Филатовна'),('Филипповна'),('Фоминична'),('Эдуардовна'),('Эрастовна'),
('Юрьевна'),('Якововна'),('Ярославовна')


